Дипломный_проект/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СозданныеДокументы</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>РеализацияТоваровУслуг</name>
      <type>
        <types>String</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Дипломный_проект/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	Если День(Объект.Период.ДатаНачала) <> 1 Или День(Объект.Период.ДатаОкончания) < 28 Тогда
		
		Сообщение = Новый СообщениеПользователю(); 
		Сообщение.Текст = "Необходимо выбрать в качестве периода один месяц";
		Сообщение.Сообщить();
		
		Возврат;
			
	КонецЕсли;
	
	ДлительнаяОперация = СоздатьДокументыНаСервере(УникальныйИдентификатор);	
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Интервал = 1; 
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении",ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания); 
	
КонецПроцедуры   

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СоздатьДокументыНаСервере(УникальныйИдентификатор)
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьДокументыТяжелаяОперация", Объект.Период);
	
КонецФункции

&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда 
		
		ДанныеДляВнесения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Для Каждого Элемент Из ДанныеДляВнесения Цикл
			
		НоваяСтрокаТЧ                        = Объект.СозданныеДокументы.Добавить();
		НоваяСтрокаТЧ.Договор                = Элемент.Ключ;
		НоваяСтрокаТЧ.РеализацияТоваровУслуг = Элемент.Значение;
				
		КонецЦикла
		
	Иначе 
		
		Сообщение = Новый СообщениеПользователю(); 
		Сообщение.Текст = Результат.Статус;
		Сообщение.Сообщить();
		
	КонецЕсли;
		
КонецПроцедуры    
     
#КонецОбласти
